app/Http/Controllers/Admin/DashboardController.php

    public function dashboard()
    {
        $wallpaperCount = Wallpapers::count();
        $ringtoneCount = Ringtones::count();
        $musicCount = Musics::count();

        $data['wallpapers_active'] = Cache::get('wallpapers_active', function () use ($wallpaperCount) {
            return Wallpapers::where('wallpaper_status', 1)->count();
        });

        $data['wallpapers_inactive'] = $wallpaperCount - $data['wallpapers_active'];

        $data['ringtones_active'] = Cache::get('ringtones_active', function () use ($ringtoneCount) {
            return Ringtones::where('ringtone_status', 1)->count();
        });

        $data['ringtones_inactive'] = $ringtoneCount - $data['ringtones_active'];

        $data['musics_active'] = Cache::get('musics_active', function () use ($musicCount) {
            return Musics::where('music_status', 1)->count();
        });

        $data['musics_inactive'] = $musicCount - $data['musics_active'];


        $data = [
            'domain' => number_format(Domain::count()),
            'tags' => number_format(Tags::count()),
            'iplist' => number_format(IPLIST::count()),

            'wallpapers' => number_format($wallpaperCount),
            'wallpapers_inactive' => number_format($data['wallpapers_inactive']),

            'ringtones' => number_format($ringtoneCount),
            'ringtones_inactive' => number_format($data['ringtones_inactive']),

            'musics' => number_format($musicCount),
            'musics_inactive' => number_format($data['musics_inactive']),
        ];
---
select count(*) as aggregate from `wallpapers`
select count(*) as aggregate from `ringtones`
select count(*) as aggregate from `musics`
select count(*) as aggregate from `wallpapers` where `wallpaper_status` = 1
select count(*) as aggregate from `ringtones` where `ringtone_status` = 1
select count(*) as aggregate from `musics` where `music_status` = 1
select count(*) as aggregate from `domains`
select count(*) as aggregate from `tags`
select count(*) as aggregate from `i_p_l_i_s_t_s`

    public function getPlatformData(Request $request): array
    {
        $start_date = Carbon::parse($request['start_date'])->format('Y-m-d');
        $end_date = Carbon::parse($request['end_date'])->format('Y-m-d');

        $query = DomainLoginLogs::whereBetween('created_at', [date($start_date), date($end_date)])
            ->selectRaw('platform_name, SUM(count) as count_platform')
            ->groupBy('platform_name')
            ->orderBy('platform_name', 'desc');

        $platformCounts = $query->get()->pluck('count_platform', 'platform_name')->toArray();
---
select platform_name, SUM(count) as count_platform from `domain_login_logs` where `created_at` between '2024-07-01' and '2024-07-31' group by `platform_name` order by `platform_name` desc

    public function getCountryData(Request $request): array
    {
        $limit  = 4;
        $start_date = Carbon::parse($request['start_date'])->format('Y-m-d');
        $end_date = Carbon::parse($request['end_date'])->format('Y-m-d');

        $query = DomainLoginLogs::whereBetween('created_at', [date($start_date), date($end_date)])
            ->selectRaw('country,SUM(count) as count_country')
            ->groupBy('country')
            ->orderBy('count_country', 'desc');

        $result = $query->get()->pluck('count_country', 'country')->toArray();
---
select country,SUM(count) as count_country from `domain_login_logs` where `created_at` between '2024-07-01' and '2024-07-31' group by `country` order by `count_country` desc

    public function getYearlyData(Request $request)
    {
        $start_date = Carbon::parse($request['start_date'])->format('Y-m-d');
        $end_date = Carbon::parse($request['end_date'])->format('Y-m-d');

        $query = DomainLoginLogs::whereBetween('created_at', [date($start_date), date($end_date)]);


        $redirect = $query
            ->groupBy(DB::raw('DATE_FORMAT(updated_at, "%b %d")'))
            ->orderBy('updated_at')
            ->select(DB::raw('DATE_FORMAT(updated_at, "%b %d") as month'), DB::raw('SUM(count) as total_login'))
            ->get()
            ->keyBy('month');
---
select DATE_FORMAT(updated_at, "%b %d") as month, SUM(count) as total_login from `domain_login_logs` where `created_at` between '2024-07-01' and '2024-07-31' group by DATE_FORMAT(updated_at, "%b %d") order by `updated_at` asc