app/Http/Controllers/Admin/DomainController.php

select count(*) as aggregate from `domains`
---
    public function getIndex(Request $request)
    {
        if(!Auth::user()->can('admin.domain')){
            return response()->json([
                'error'=> 'Tài khoản không có quyền.',
            ]);
        }
        $draw = $request->input('draw');
        $start = $request->get("start");
        $length = $request->input('length');
        $page = $request->input('page');

        $columnIndex = $request->input('order')[0]['column'];
        $columnName = $request->input('columns')[$columnIndex]['data'];
        $columnSortOrder = $request->input('order')[0]['dir'];
        $searchValue = $request->input('search')['value'];

        $domainsQuery = Domain::withCount('categories');
        $domainsQuery
            ->when(isset($searchValue), function ($query) use ($searchValue) {
                $searchTerm = '%' . $searchValue . '%';
                $query->where('domain_web', 'like', $searchTerm)
                    ->orWhere('domain_name', 'like', $searchTerm)
                    ->orWhere('domain_project', 'like', $searchTerm);
            });

        $totalRecordswithFilter = $domainsQuery->count();

select * from `domains` where `domains`.`id` = '1' limit 1
---
    public function edit($id)
    {
        if(!Auth::user()->can('admin.domain.edit')){
            return response()->json([
                'error'=> 'Tài khoản không có quyền.',
            ]);
        }
        $domain = Domain::find($id);

select * from `domains` where `domains`.`id` = '1' limit 1
---
    public function categories($id)
    {
        if(!Auth::user()->can('admin.domain')){
            abort(403);
        }
        $domain_id = $id;
        $title = 'Categories';
        $domain = Domain::find($domain_id);

select count(*) as aggregate from `categories` where `domain_id` = '1'
---
    public function getDomainCategories(Request $request)
    {
        if(!Auth::user()->can('admin.domain')){
            return response()->json([
                'error'=> 'Tài khoản không có quyền.',
            ]);
        }
        $draw = $request->input('draw');
        $start = $request->get("start");
        $length = $request->input('length');
        $page = $request->input('page');

        $columnIndex = $request->input('order')[0]['column'];
        $columnName = $request->input('columns')[$columnIndex]['data'];
        $columnSortOrder = $request->input('order')[0]['dir'];
        $searchValue = $request->input('search')['value'];

        $categoriesQuery = Categories::withCount('wallpapers','ringtones','musics');
        $categoriesQuery
            ->when(isset($searchValue), function ($query) use ($searchValue) {
                $searchTerm = '%' . $searchValue . '%';
                $query->where('category_name', 'like', $searchTerm);
            })->where('domain_id', $request->domain_id);

        $totalRecordswithFilter = $categoriesQuery->count();

select * from `domains` where `domains`.`id` = '1' limit 1
---
    public function logs($id)
    {
        if(!Auth::user()->can('admin.domain')){
            abort(403);
        }
        $domain_id = $id;
        $title = 'Logs';
        $domain = Domain::find($domain_id);

select count(*) as aggregate from `domain_login_logs` where `domain_id` = '1'
select * from `domain_login_logs` where `domain_id` = '1' order by `count` desc limit 25 offset 0
---
    public function getDomainLogs(Request $request,$id)
    {
        if(!Auth::user()->can('admin.domain')){
            return response()->json([
                'error'=> 'Tài khoản không có quyền.',
            ]);
        }
        $draw = $request->input('draw');
        $start = $request->get("start");
        $length = $request->input('length');

        $columnIndex = $request->input('order')[0]['column'];
        $columnName = $request->input('columns')[$columnIndex]['data'];
        $columnSortOrder = $request->input('order')[0]['dir'];
        $searchValue = $request->input('search')['value'];

        $domainLogsQuery = DomainLoginLogs::query();
        $domainLogsQuery->where('domain_id',$id)
            ->when(isset($searchValue), function ($query) use ($searchValue) {
                $searchTerm = '%' . $searchValue . '%';
                $query->where('ip_address', 'like', $searchTerm)
                    ->orwhere('device_name', 'like', $searchTerm)
                    ->orwhere('platform_name', 'like', $searchTerm)
                    ->orwhere('country', 'like', $searchTerm)
                    ->orwhere('browser', 'like', $searchTerm);
            });

        $totalRecordswithFilter = $domainLogsQuery->count();

        $records = $domainLogsQuery
            ->orderBy($columnName, $columnSortOrder)
            ->skip($start)
            ->take($length)
            ->get();