app/Http/Controllers/Admin/DomainLoginLogsController.php

select * from `list_types`
---
    public function index()
    {
        if(!Auth::user()->can('admin.domainLoginLogs')){
            abort(403);
        }
        $data['title'] = 'Domain Login Logs';
        $data['list_type'] = ListType::all();

select count(*) as aggregate from `domain_login_logs`
select * from `domain_login_logs` order by `updated_at` desc limit 25 offset 0
select * from `domains` where `domains`.`id` in (6, 71, 73, 74, 97, 116, 122, 123, 128, 131, 193, 196, 263, 304, 328)
---
    public function getIndex(Request $request)
    {
        if(!Auth::user()->can('admin.domainLoginLogs')){
            return response()->json([
                'error'=> 'Tài khoản không có quyền.',
            ]);
        }
        $draw = $request->input('draw');
        $start = $request->get("start");
        $length = $request->input('length');

        $columnIndex = $request->input('order')[0]['column'];
        $columnName = $request->input('columns')[$columnIndex]['data'];
        $columnSortOrder = $request->input('order')[0]['dir'];
        $searchValue = $request->input('search')['value'];

        $domainsLogsQuery = DomainLoginLogs::with('domain','ip_block');
        $domainsLogsQuery
            ->when(isset($searchValue), function ($query) use ($searchValue) {
                $searchTerm = '%' . $searchValue . '%';
                $query->where('ip_address', 'like', $searchTerm)
                    ->orWhereHas('domain', function($query) use ($searchTerm) {
                        $query->where('domain_web', 'like', $searchTerm );
                    });
            });

        $totalRecordswithFilter = $domainsLogsQuery->count();

        $records = $domainsLogsQuery
            ->orderBy($columnName, $columnSortOrder)
            ->skip($start)
            ->take($length)
            ->get();