app/Http/Controllers/Admin/LoginController.php

    protected function authenticated(Request $request, $user)
    {
        if($user->status == 0){
            $this->guard('guard')->logout();
//            return $this->loggedOut($request) ?: redirect()->route('admin.login');
            return redirect()->route('admin.login')->with('error', 'You are banned from this application. Please contact with system Administrator.');
        }

        $user->last_login = Carbon::now();
        $user->last_login_ip = getIp();
        $user->save();

        $agent = new Browser();
        $geoIP = new GeoIP;
        $location = $geoIP::getLocation(getIp());

        $ul['user_id'] = $user->id;
        $ul['user_ip'] =  getIp();

        $ul['country'] = $location['country']?? null;
        $ul['location'] = $location['city']?? null;
        $ul['country_code'] = $location['iso_code']?? null;
        $ul['latitude'] = $location['lat']?? null;
        $ul['longitude'] = $location['lon']?? null;
        $ul['os'] = $agent->platformFamily();
        $ul['browser'] = $agent->browserFamily();

        AdminLoginLog::create($ul);
---
insert into `admin_login_logs` (`user_id`, `user_ip`, `country`, `location`, `country_code`, `latitude`, `longitude`, `os`, `browser`, `updated_at`, `created_at`) values (1, '127.0.0.1', 'United States', 'New Haven', 'US', 41.31, -72.92, 'Windows', 'Microsoft Edge', '2024-07-14 13:17:20', '2024-07-14 13:17:20')